refactored the types script parts
